{"c2dictionary":true,"data":{
"0":"Internet of Things (IoT) อินเทอร์เน็ตในทุกสิ่ง หมายถึง การที่อุปกรณ์ต่าง ๆ สิ่งต่าง ๆ ได้ถูกเชื่อมโยงทุกสิ่งทุกอย่างสู่โลกอินเทอร์เน็ต ทำให้มนุษย์สามารถสั่งการควบคุมการใช้งานอุปกรณ์ต่าง ๆ ผ่านทางเครือข่ายอินเตอร์เน็ต เช่น การเปิด-ปิด อุปกรณ์เครื่องใช้ไฟฟ้า เช่น การสั่งการเปิดไฟฟ้าภายในบ้านด้วยการเชื่อมต่ออุปกรณ์ควบคุม เช่น มือถือ ผ่านทางอินเทอร์เน็ต รถยนต์ โทรศัพท์มือถือ เครื่องมือสื่อสาร เครื่องมือทางการเกษตร อาคาร บ้านเรือน เครื่องใช้ในชีวิตประจำวันต่าง ๆ ผ่านเครือข่ายอินเทอร์เน็ต เป็นต้น",
"1":"เซนเซอร์ (sensor) คือ อุปกรณ์ที่ทำหน้าที่ตรวจสอบ ตรวจจับ การเปลี่ยนแปลงคุณสมบัติหรือสิ่งแวดล้อมเพื่อรับรู้สถานะของอุปกรณ์ในขณะนั้น เช่น การเปลี่ยนตำแหน่ง, อุณหภูมิ, รูปร่าง, ขนาด จากนั้นจึงทำการประมวลผลและแปลงสัญญาณก่อน ส่งให้กับชุดควบคุม เพื่อแสดงเป็นผลลัพธ์ที่เราต้องการ เช่น เซนเซอร์วัดอุณหภูมิ, เซนเซอร์ตรวจจับความเร็ว, เซนเซอร์ตรวจจับการเคลื่อนไหว เป็นต้น",
"2":"เซ็นเซอร์วัดความชื้นและอุณหภูมิสภาพแวดล้อม (Digital Humidity and Temperature Sensor:DHT) เป็นเซนเซอร์วัดอุณหภูมิในช่วง 0-60 องศาเซียลเซียส และความชื้นในอากาศในช่วง 20-90% แบบติดตั้งลงแผ่น PCB มาพร้อม Library มาตรฐานสำหรับใช้งานและสามารถใช้งานร่วมกับ ไมโครคอนโทรลเลอร์บอร์ดแบบสำเร็จรูป Arduino (อา-ดู-อิ-โน่ หรือ อาดุยโน่) ได้",
"3":"ตัวต้านทานปรับค่าตามความเข้มแสงแอลดีอาร์ (Light Dependent Resistor:LDR)คือ ตัวต้านทานชนิดที่ไวต่อแสง หรือ ตัวต้านทานนี้สามารถเปลี่ยนสภาพทางความนำไฟฟ้า ได้เมื่อมีแสงมาตกกระทบ",
"4":"เซนเซอร์วัดระยะทางด้วยคลื่น Ultrasonic (Ultrasonic Seosor) ตัว Sensor นี้ จะส่งคลื่นออกไปแล้วจับเวลาที่คลื่นกระทบกับวัตถุสะท้อนกลับมาเข้าตัวรับทำให้สามารถวัดระยะทางระหว่างวัตถุถึงตัวเซ็นเซอร์วัดระยะทาง Ultrasonic Module HC-SR04 ได้",
"5":"เซ็นเซอร์ตรวจจับการเคลื่อนไหว (Motion Sensor) ใช้สำหรับตรวจจับความเคลื่อนไหวจากความร้อน เช่น สิ่งมีชีวิต เมื่อมีคนเดินผ่าน motion sensor switch ก็จะจับค่าความร้อนที่เปลี่ยนแปลง แล้วส่งค่าสัญญาณไฟฟ้าออกมา ในกรณีที่ไม่มีการเปลี่ยนแปลงส่งค่าไฟ สัญญาณ 0 วัตต์ ออกมา เราสามารถนำค่านี้ไปสั่งควบคุมบอร์ด Arduino ได้ สามารถปรับเวลาหน่วงเวลาในการตรวจจับครั้งต่อไปได้ ปรับระยะทางการตรวจจับได้ 3-7 เมตร มีช่องให้ต่อ LDR เพิ่ม เพื่อให้ทำงานตรวจจับแค่ตอนกลางคืน"
}}